import Head from "next/head";
import Image from "next/image";
import Link from "next/link";

import styles from "../styles/make.module.css";

const make = () => {
  return (
    <div>
      <Head>
        <title>inweblife - Как се прави сайт</title>
        <meta name="description" content="inweblife - Вашият живот в мрежата" />
        <meta name="keywords" content="Как се прави сайт през 2023 г." />
        <link rel="icon" href="/favicon.jpg" />
      </Head>

      <div className={styles.container}>
        <div className={styles.picture}>
          <Image
            src="/working.webp"
            alt="workspace"
            width={780}
            height={500}
            style={{
              maxWidth: "100%",
              height: "auto",
            }}
          />
        </div>

        <h1 className={styles.heading}>Как се прави сайт 2023 г.</h1>

        <div className={styles.text}>
          <p className={styles.paragraph}>
            Има много начини да <Link href="/powerful-site">направите Вашето онлайн присъствие запомнящо</Link> се
            - може да наемете агенция да Ви направи сайт, може да наемете
            специалист, но при всички случаи, освен разработчик, ще имате нужда
            и от SEO експерт.
          </p>

          <p className={styles.paragraph}>
            {" "}
            Може да похарчите много пари, за да Ви направят най-страхотния сайт,
            обаче, без оптимизация, той няма да има шансове да се класира на
            видимо място в Google.
          </p>

          <p className={styles.paragraph}>
            Ако ползвате платформа като WordPress, например, Вие скоро ще
            разберете, че <Link href="/seo-fashion">техническата оптимизация на сайта</Link> не Ви позволява да
            зареждате бързо страниците, което не създава добро преживяване у
            посетителите.
          </p>

          <p className={styles.paragraph}>
            Ще трябва да се абонирате за кеширащи плъгини, които са доста скъпи
            и определено няма да Ви излиза сметката, докато ако направите
            оптимизиран сайт, който се зарежда бързо и съдържанието му е
            качествено, имате отлични шансове.
          </p>
          <p className={styles.paragraph}>
            Разбира се, Вие ще искате сайта Ви да бъде видим за търсачките и да
            се класира най-добре в Google. Може да наемете агенция, която да
            работи върху SEO-то на сайта Ви, обаче, това струва скъпо и пак няма
            да Ви излиза сметката.
          </p>

          <p className={styles.paragraph}>
            {" "}
            Защото оптимизацията на сайт започва преди да се направи. Една от
            най-често допусканите грешки от собствениците на сайтове е, че
            търсят SEO експерти след като са направили сайта.
          </p>

          <p className={styles.paragraph}>
            После ще искате да рекламирате в Google и Facebook, да си направите
            страници в социалните мрежи, профили и да се представите пред
            аудиторията, пред потенциалните си клиенти.
          </p>
          <p className={styles.paragraph}>
            За всичко това ще Ви трябва опитен специалист, който умее да създаде
            съдържанието на сайта, дизайна му, да го оптимизира, така че
            клиентите лесно да го намират и вътре да откриват решението на онези
            въпроси, за които влизат да търсят в Google.
          </p>
          <p className={styles.paragraph}>
            Тези всички неща трябва да вземете предвид, преди да вземете решение
            за изграждането на Вашия сайт и публикуването му в
            уеб-пространството. При това в един добре подреден ред, като
            неотчитането на един фактор от цялата картина, може да Ви струва
            скъпо.
          </p>

          <p className={styles.paragraph}>
            А никой няма да откаже да Ви вземе парите, за да Ви направи сайт или
            да Ви консултира в онази част, в която е силен, без да се стреми на
            всяка цена да Ви уведоми, какви точно трябва да бъдат стъпките,
            които предстои да извървите.
          </p>
        </div>
      </div>
      <div className={styles.next}>
        <Link href="/powerful-site">Създайте мощен сайт</Link>
        <Link href="/modern-site">Как се прави модерен сайт</Link>
      </div>
    </div>
  );
};

export default make;
