import Head from 'next/head';
import Image from 'next/image';
import Link from 'next/link';
import styles from '../styles/powerful-site.module.css';

const power = () => {
  return (
    <div>
      <Head>
        <title>inweblife - Мощен сайт</title>
        <meta name="description" content="inweblife - Вашият живот в мрежата" />
        <meta name="keywords" content="Създайте мощен сайт" />
        <link rel="icon" href="/favicon.jpg" />
      </Head>

      <div className={styles.container}>
        <div className={styles.picture}>
          <Image src="/working.jpg" alt="workspace" width={780} height={500} />
        </div>

        <h1 className={styles.heading}>Създайте мощен сайт</h1>

        <div className={styles.text}>
          <p className={styles.paragraph}>
            От много години се занимавам професионално със създаване на Web
            съдържание и неговото качване в мрежата, за да се представи отделен
            човек, бизнес или предмет на дадена дейност. В работата си у нас
            забелязвам една все по-преднамерена упоритост всеки един разработчик
            да изявява себе си за сметка на клиентите.
          </p>

          <p className={styles.paragraph}>
          Един от най-сериозните проблеми, с които се сблъсквам е, когато клиент поръча своя сайт, своята визитка в мрежата, а разработчикът не опита да обясни нищо, от онова, което е важно да знае клиента. Клиентите, в повечето случаи, въобще, нямат представа как трябва да бъде създанен един сайт. И това не им е работа. Това е работата на разработчиците, които, обаче, не се интересуват, какво точно ще стане с онова, което са направили, щом веднъж вече са взели за него някакви пари. 
          </p>

          <p className={styles.paragraph}>
          Сблъсквах се с програмисти, които бяха убедени, че тяхната работа е просто да разработят някакви страници в някакъв сайт, а дали той ще изглежда добре на мобилни устройва, никой не се интересуваше. Попадах на разработчици, които изготвяха сайтове без, въобще, да ги интересува дали те са SEO оптимизирани за рекламиране в Google и социалните мрежи. Срещах маркетолози, които извиваха ръцете на клиентите си, че сайта им няма как да има добро представяне в социалните мрежи, тъй като когато са го поръчвали на разработчиците, не са се допитали до тяхното експертно SEO мнение. И пр, и пр. 
          </p>

          <p className={styles.paragraph}>
            Във всички случаи, всички тези небивалици не решаваха проблемите на клиентите, а още повече ги объркваха, с което проблемите им се задълбочаваха. 
          </p>

          <p className={styles.paragraph}>
            Много бързо разрбах, че един сайт трябва да бъде направен от самото начало в пълен синхрон с неговото бъдещо представяне в социалните мрежи, да се вземе предвид, че ще се рекламира в Google и Facebook, да се стилизира, така че да бъде добре представен, както на мобилно устройство, така и на десктоп компютър, да се изпълни изцяло по Web core vitalis съображенията, измерванията за потребителско изживяване и всички пропоръки в тази посока, включително скорост, зареждане на съдържанието, интерактивност и удобство, удоволствие за потребителя.
          </p>
          
        </div>
      </div>
      <div className={styles.next}>
      <Link href="/modern-site">
        <a className={styles.next}>Как се прави модерен сайт</a>
      </Link>
      <Link href="/seo-fashion">
        <a className={styles.next}>Ерата на смартфоните</a>
      </Link>
      </div>
    </div>
  );
};

export default power;
