import Head from "next/head";
import Image from "next/image";
import Link from "next/link";

import styles from "../styles/make.module.css";

const seo = () => {
  return (
    <div>
      <Head>
        <title>inweblife - SEO оптимизация</title>
        <meta name="description" content="inweblife - Вашият живот в мрежата" />
        <meta name="keywords" content="В ерата на смартфоните." />
        <link rel="icon" href="/favicon.webp" />
      </Head>

      <div className={styles.container}>
        <div className={styles.picture}>
          <Image
            src="/desk.webp"
            alt="workspace"
            width={780}
            height={500}
            style={{
              maxWidth: "100%",
              height: "auto",
            }}
          />
        </div>

        <h1 className={styles.heading}>В ерата на смартфоните.</h1>

        <div className={styles.text}>
          <p className={styles.paragraph}>
            Когато се създава сайт, разработчикът трябва да вземе предвид
            измежду много неща, които предстои да направи, така че да изпълни
            задачата по такъв начин, че да не пренебрегне най-добрите практики
            познати в света.
          </p>

          <p className={styles.paragraph}>
            При всички случаи, клиентът ще иска <Link href="/modern-site">сайтът му да се индексира</Link> по
            възможно най-добрия начин от Google, поради което разработчикът ще
            трябва да се съобрази с най-главните фактори, според които се
            индексира сайтът, така че да се показва колкото се може повече
            най-горе в резултатите при търсене.
          </p>

          <p className={styles.paragraph}>
            Това включва да вземе предвид скорост на зареждане, мобилен изглед,
            формат и компресия на снимките, <Link href="/powerful-site">SEO фактори</Link>, съдържание, ключови
            думи и пр. Нека обърнем внимание на мобилния изглед и начинът, по
            който Google го намира за важен. В началото на 2009 година почти
            няма посещения в сайтовете от мобилни устройства.
          </p>

          <p className={styles.paragraph}>
            През 2016-а година вече ръстът на посещенията от смартфони е
            по-висок, отколкото от десктоп компютри, а в днешни дни се счита, че
            процентът на влизания от мобилни устройства е над 80%.
          </p>

          <p className={styles.paragraph}>
            Този огромен прогрес на мобилните технологии предизвика
            разработчиците да моделират сайтовете, така че първо и приоритетно
            да се съобразяват с мобилния им изглед, как изглеждат на различните
            резолюции и размери смартфони, по дължина, височина и ширина, едва
            след което да се разработват за това, как ще изглеждат на таблет и
            десктоп компютри с различни резолюции, големина на екрана и пр.
          </p>

          <p className={styles.paragraph}>
            На 21 Април 2015 година Google официално обяви, че занапред ще дава
            предимство за по-високо класиране в търсачките на сайтовете с
            адаптивен дизайн, а това окончателно принуди разработчиците да
            строят сайтовете съобразявайки се с това, как изглеждат през екрана
            на телефона Ви.
          </p>

          <p className={styles.paragraph}>
            Разработчиците на Twitter вече бяха създали популярната в днешни дни
            библиотека Bootstrap и така улесниха значително работата на колегите
            си в бранша, тъй като сега е достатъчно да се свърже само с два-три
            реда код този брилянтен ресурс и създадения сайт става адаптивен
            спрямо дисплея, на който се разглежда, екранът бива моментално
            засечен и съразмерно съдържанието, така че да подобрява максимално
            потребителското изживяване, което се нарежда, също, сред основните
            фактори, които взима предвид Google, когато индексира сайтовете
            по-горе и по-високо в търсачката си.
          </p>

          <p className={styles.paragraph}>
            Начинът, по който се <Link href="/how-to-make-site">правят сайтовете</Link> в днешно време е различен от
            начина, по който се правеха преди това. Затова, когато мислите за
            изграждането на сайта, трябва да мислите за него като вече
            позициониран в мрежата, как изглежда на всички типове екрани, бързо
            ли се зарежда, носи ли позитивно потребителско изживяване, отговаря
            ли на търсенията, които ще водят към него, едва след като намерите
            отговорите на тези въпроси, търсете други, защото тези са
            най-важните.
          </p>
        </div>
      </div>
      <div className={styles.next}>
        <Link href="/modern-site">Как се прави модерен сайт</Link>
        <Link href="/powerful-site">Създайте мощен сайт</Link>
      </div>
    </div>
  );
};

export default seo;
